#!/bin/bash

if [ $# -eq 0 ]; then
    echo "Ошибка: Вы не ввели числа."
    echo "Пример запуска: $0 5 3 8 1"   
    exit 1
fi

M=("$@")

echo -n "До: " // -n нужна, чтобы цифры не сьезжали на строку ниже, а были на одной с "До: "
echo "${M[@]}" // выводит на экран все элементы массива через пробел

mapfile -t M < <(printf "%s\n" "${M[@]}" | sort -n) // -t убирает символ перевода строки (Enter) в конце каждой строки

echo -n "После: "
echo "${M[@]}" // выводит на экран все элементы массива черех пробел
